---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorTextType
source: html/6327b05a-0980-836f-fa97-6b913cf6b495.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorTextType Property

Type of vector text visualization.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleVectorTextType VectorTextType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration